icboredman/TeensyCam-SW/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);

    /* PORTA12 (pin 64) is configured as FTM1_CH0 */
    PORT_SetPinMux(BOARD_INITPINS_SYSCLK_PORT, BOARD_INITPINS_SYSCLK_PIN, kPORT_MuxAlt3);

    /* PORTA14 (pin 66) is configured as PTA14 */
    PORT_SetPinMux(BOARD_INITPINS_FRVAL1_PORT, BOARD_INITPINS_FRVAL1_PIN, kPORT_MuxAsGpio);

    PORTA->PCR[14] = ((PORTA->PCR[14] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTA15 (pin 67) is configured as PTA15 */
    PORT_SetPinMux(BOARD_INITPINS_PIXCLK1_PORT, BOARD_INITPINS_PIXCLK1_PIN, kPORT_MuxAsGpio);

    PORTA->PCR[15] = ((PORTA->PCR[15] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                      | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTA26 (pin 77) is configured as PTA26 */
    PORT_SetPinMux(BOARD_INITPINS_PIXCLK2_PORT, BOARD_INITPINS_PIXCLK2_PIN, kPORT_MuxAsGpio);

    PORTA->PCR[26] = ((PORTA->PCR[26] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                      | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTA28 (pin 79) is configured as PTA28 */
    PORT_SetPinMux(BOARD_INITPINS_LNVAL2_PORT, BOARD_INITPINS_LNVAL2_PIN, kPORT_MuxAsGpio);

    PORTA->PCR[28] = ((PORTA->PCR[28] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                      | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTA29 (pin 80) is configured as PTA29 */
    PORT_SetPinMux(BOARD_INITPINS_FRVAL2_PORT, BOARD_INITPINS_FRVAL2_PIN, kPORT_MuxAsGpio);

    PORTA->PCR[29] = ((PORTA->PCR[29] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                      | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTA5 (pin 55) is configured as PTA5 */
    PORT_SetPinMux(BOARD_INITPINS_LNVAL1_PORT, BOARD_INITPINS_LNVAL1_PIN, kPORT_MuxAsGpio);

    PORTA->PCR[5] = ((PORTA->PCR[5] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp));

    /* PORTB10 (pin 91) is configured as PTB10 */
    PORT_SetPinMux(BOARD_INITPINS_STLN_OUT1_PORT, BOARD_INITPINS_STLN_OUT1_PIN, kPORT_MuxAsGpio);

    /* PORTB11 (pin 92) is configured as PTB11 */
    PORT_SetPinMux(BOARD_INITPINS_STLN_OUT2_PORT, BOARD_INITPINS_STLN_OUT2_PIN, kPORT_MuxAsGpio);

    /* PORTB16 (pin 95) is configured as PTB16 */
    PORT_SetPinMux(BOARD_INITPINS_STANDBY_PORT, BOARD_INITPINS_STANDBY_PIN, kPORT_MuxAsGpio);

    /* PORTB18 (pin 97) is configured as PTB18 */
    PORT_SetPinMux(BOARD_INITPINS_EXPOSURE_PORT, BOARD_INITPINS_EXPOSURE_PIN, kPORT_MuxAsGpio);

    /* PORTB19 (pin 98) is configured as PTB19 */
    PORT_SetPinMux(BOARD_INITPINS_STFRM_OUT_PORT, BOARD_INITPINS_STFRM_OUT_PIN, kPORT_MuxAsGpio);

    /* PORTB2 (pin 83) is configured as I2C0_SCL */
    PORT_SetPinMux(BOARD_INITPINS_SCL_PORT, BOARD_INITPINS_SCL_PIN, kPORT_MuxAlt2);

    PORTB->PCR[2] = ((PORTB->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTB3 (pin 84) is configured as I2C0_SDA */
    PORT_SetPinMux(BOARD_INITPINS_SDA_PORT, BOARD_INITPINS_SDA_PIN, kPORT_MuxAlt2);

    PORTB->PCR[3] = ((PORTB->PCR[3] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTC0 (pin 103) is configured as PTC0 */
    PORT_SetPinMux(BOARD_INITPINS_PTC0_PORT, BOARD_INITPINS_PTC0_PIN, kPORT_MuxAsGpio);

    /* PORTC1 (pin 104) is configured as PTC1 */
    PORT_SetPinMux(BOARD_INITPINS_PTC1_PORT, BOARD_INITPINS_PTC1_PIN, kPORT_MuxAsGpio);

    /* PORTC10 (pin 115) is configured as PTC10 */
    PORT_SetPinMux(BOARD_INITPINS_PTC10_PORT, BOARD_INITPINS_PTC10_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[10] = ((PORTC->PCR[10] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

