icboredman/TeensyCam-SW/board/pin_mux.c
    /* PORTC11 (pin 116) is configured as PTC11 */
    PORT_SetPinMux(BOARD_INITPINS_PTC11_PORT, BOARD_INITPINS_PTC11_PIN, kPORT_MuxAsGpio);

    PORTC->PCR[11] = ((PORTC->PCR[11] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                       * corresponding PE field is set. */
                      | (uint32_t)(kPORT_PullUp));

    /* PORTC2 (pin 105) is configured as PTC2 */
    PORT_SetPinMux(BOARD_INITPINS_PTC2_PORT, BOARD_INITPINS_PTC2_PIN, kPORT_MuxAsGpio);

    /* PORTC3 (pin 106) is configured as PTC3 */
    PORT_SetPinMux(BOARD_INITPINS_PTC3_PORT, BOARD_INITPINS_PTC3_PIN, kPORT_MuxAsGpio);

    /* PORTC4 (pin 109) is configured as PTC4 */
    PORT_SetPinMux(BOARD_INITPINS_PTC4_PORT, BOARD_INITPINS_PTC4_PIN, kPORT_MuxAsGpio);

    /* PORTC5 (pin 110) is configured as PTC5 */
    PORT_SetPinMux(BOARD_INITPINS_PTC5_PORT, BOARD_INITPINS_PTC5_PIN, kPORT_MuxAsGpio);

    /* PORTC6 (pin 111) is configured as PTC6 */
    PORT_SetPinMux(BOARD_INITPINS_PTC6_PORT, BOARD_INITPINS_PTC6_PIN, kPORT_MuxAsGpio);

    /* PORTC7 (pin 112) is configured as PTC7 */
    PORT_SetPinMux(BOARD_INITPINS_PTC7_PORT, BOARD_INITPINS_PTC7_PIN, kPORT_MuxAsGpio);

    /* PORTC8 (pin 113) is configured as PTC8 */
    PORT_SetPinMux(BOARD_INITPINS_PTC8_PORT, BOARD_INITPINS_PTC8_PIN, kPORT_MuxAsGpio);

    /* PORTC9 (pin 114) is configured as PTC9 */
    PORT_SetPinMux(BOARD_INITPINS_PTC9_PORT, BOARD_INITPINS_PTC9_PIN, kPORT_MuxAsGpio);

    /* PORTD0 (pin 127) is configured as PTD0 */
    PORT_SetPinMux(BOARD_INITPINS_PTD0_PORT, BOARD_INITPINS_PTD0_PIN, kPORT_MuxAsGpio);

    /* PORTD1 (pin 128) is configured as PTD1 */
    PORT_SetPinMux(BOARD_INITPINS_PTD1_PORT, BOARD_INITPINS_PTD1_PIN, kPORT_MuxAsGpio);

    /* PORTD12 (pin 141) is configured as PTD12 */
    PORT_SetPinMux(BOARD_INITPINS_PTD12_PORT, BOARD_INITPINS_PTD12_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[12] = ((PORTD->PCR[12] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                      | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTD13 (pin 142) is configured as PTD13 */
    PORT_SetPinMux(BOARD_INITPINS_PTD13_PORT, BOARD_INITPINS_PTD13_PIN, kPORT_MuxAsGpio);

    PORTD->PCR[13] = ((PORTD->PCR[13] &
                       /* Mask bits to zero which are setting */
                       (~(PORT_PCR_PE_MASK | PORT_PCR_ISF_MASK)))

                      /* Pull Enable: Internal pullup or pulldown resistor is not enabled on the corresponding pin. */
                      | PORT_PCR_PE(kPORT_PullDisable));

    /* PORTD2 (pin 129) is configured as PTD2 */
    PORT_SetPinMux(BOARD_INITPINS_PTD2_PORT, BOARD_INITPINS_PTD2_PIN, kPORT_MuxAsGpio);

    /* PORTD3 (pin 130) is configured as PTD3 */
    PORT_SetPinMux(BOARD_INITPINS_PTD3_PORT, BOARD_INITPINS_PTD3_PIN, kPORT_MuxAsGpio);

    /* PORTD4 (pin 131) is configured as PTD4 */
    PORT_SetPinMux(BOARD_INITPINS_PTD4_PORT, BOARD_INITPINS_PTD4_PIN, kPORT_MuxAsGpio);

    /* PORTD5 (pin 132) is configured as PTD5 */
    PORT_SetPinMux(BOARD_INITPINS_PTD5_PORT, BOARD_INITPINS_PTD5_PIN, kPORT_MuxAsGpio);

    /* PORTD6 (pin 133) is configured as PTD6 */
    PORT_SetPinMux(BOARD_INITPINS_PTD6_PORT, BOARD_INITPINS_PTD6_PIN, kPORT_MuxAsGpio);

    /* PORTD7 (pin 136) is configured as PTD7 */
    PORT_SetPinMux(BOARD_INITPINS_PTD7_PORT, BOARD_INITPINS_PTD7_PIN, kPORT_MuxAsGpio);

    /* PORTD8 (pin 137) is configured as PTD8 */
    PORT_SetPinMux(BOARD_INITPINS_PTD8_PORT, BOARD_INITPINS_PTD8_PIN, kPORT_MuxAsGpio);

    /* PORTD9 (pin 138) is configured as PTD9 */
    PORT_SetPinMux(BOARD_INITPINS_PTD9_PORT, BOARD_INITPINS_PTD9_PIN, kPORT_MuxAsGpio);

    SIM->SOPT4 = ((SIM->SOPT4 &
                   /* Mask bits to zero which are setting */
                   (~(SIM_SOPT4_FTM1CH0SRC_MASK)))

                  /* FTM1 channel 0 input capture source select: FTM1_CH0 signal. */
                  | SIM_SOPT4_FTM1CH0SRC(SOPT4_FTM1CH0SRC_FTM));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
